In [3]:
s = { 'a' : [1,2,3,4],
      'b' : [5,6,7,8],
      'c' : ['Sovan', 'Kamlesh', 'Iniesta', 'Ronaldo']}

In [4]:
import pandas as pd

In [5]:
df = pd.DataFrame(s)

In [6]:
df

   a  b        c
0  1  5    Sovan
1  2  6  Kamlesh
2  3  7  Iniesta
3  4  8  Ronaldo

                                                                        set_index

In [10]:
df.set_index('a')

   b        c
a
1  5    Sovan
2  6  Kamlesh
3  7  Iniesta
4  8  Ronaldo

                                                                            reset_index

In [12]:
df.reset_index()

   index  a  b        c
0      0  1  5    Sovan
1      1  2  6  Kamlesh
2      2  3  7  Iniesta
3      3  4  8  Ronaldo

                                                                            reindex

In [13]:
df.reindex([1, 0,3,2])

   a  b        c
1  2  6  Kamlesh
0  1  5    Sovan
3  4  8  Ronaldo
2  3  7  Iniesta

                                                                                iterrows
    
    Iterate 1 by one

In [15]:
for i in df.iterrows():
    print (i)

(0, a        1
b        5
c    Sovan
Name: 0, dtype: object)
(1, a          2
b          6
c    Kamlesh
Name: 1, dtype: object)
(2, a          3
b          7
c    Iniesta
Name: 2, dtype: object)
(3, a          4
b          8
c    Ronaldo
Name: 3, dtype: object)

In [16]:
for i, j in df.iterrows():
    print (i, j)

0 a        1
b        5
c    Sovan
Name: 0, dtype: object
1 a          2
b          6
c    Kamlesh
Name: 1, dtype: object
2 a          3
b          7
c    Iniesta
Name: 2, dtype: object
3 a          4
b          8
c    Ronaldo
Name: 3, dtype: object

In [17]:
for i, j in df.iterrows():
    print (j)

a        1
b        5
c    Sovan
Name: 0, dtype: object
a          2
b          6
c    Kamlesh
Name: 1, dtype: object
a          3
b          7
c    Iniesta
Name: 2, dtype: object
a          4
b          8
c    Ronaldo
Name: 3, dtype: object

sum of all items

In [18]:
def test(x):
    return(x.sum())

df.apply(test)

a                            10
b                            26
c    SovanKamleshIniestaRonaldo
dtype: object

Square of all items

In [19]:
df2 = df[['a', 'b']]

In [20]:
df2

   a  b
0  1  5
1  2  6
2  3  7
3  4  8

In [21]:
def test_quare(test):
    return pow(test,2)

In [23]:
df2.apply(test_quare)

    a   b
0   1  25
1   4  36
2   9  49
3  16  64

                                                                                SORT

In [25]:
df.sort_values('c')

   a  b        c
2  3  7  Iniesta
1  2  6  Kamlesh
3  4  8  Ronaldo
0  1  5    Sovan

In [27]:
#sort by Desecnding order

In [31]:
df.sort_index(ascending = False)

   a  b        c
3  4  8  Ronaldo
2  3  7  Iniesta
1  2  6  Kamlesh
0  1  5    Sovan

                                                                                View large set of data

In [43]:
pd.set_option("display.max_colwidth",100000)

df3 = pd.DataFrame( { 'Desc': [" If no password"," has been configured", "you need to open the server with its login token in the URL, or paste it above. This requirement will be lifted if you enable a passwo"]})

In [44]:
df3

                                                                                                                                     Desc
0                                                                                                                          If no password
1                                                                                                                     has been configured
2  you need to open the server with its login token in the URL, or paste it above. This requirement will be lifted if you enable a passwo

In [45]:
#check how many length 

df3['Desc'].apply(len)

0     15
1     20
2    134
Name: Desc, dtype: int64

In [53]:
#check how many words

df3['Word Count'] = df3['Desc'].apply(lambda x : len(x.split()))

In [54]:
df3

,Desc,Word Count
0,If no password,3
1,has been configured,3
2,"you need to open the server with its login token in the URL, or paste it above. This requirement will be lifted if you enable a passwo",27

                                                            Statistical Function - Working on stat, mean

In [57]:
df['a']

0    1
1    2
2    3
3    4
Name: a, dtype: int64

In [58]:
df['a'].std()

1.2909944487358056

In [59]:
df['a'].sum()

10

In [60]:
df['a'].min()

1

                                                                Rolling Window functions

In [61]:
df3  = pd.DataFrame({'a' : [1,2,3,4,5,6]})

In [62]:
df3

   a
0  1
1  2
2  3
3  4
4  5
5  6

In [64]:
df3['a'].rolling(window =2).mean()

0    NaN
1    1.5
2    2.5
3    3.5
4    4.5
5    5.5
Name: a, dtype: float64